vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/drivers/fsl_i3c.h
/*! @brief I3C slave transfer structure */
typedef struct _i3c_slave_transfer
{
    uint32_t event;            /*!< Reason the callback is being invoked. */
    uint8_t *txData;           /*!< Transfer buffer */
    size_t txDataSize;         /*!< Transfer size */
    uint8_t *rxData;           /*!< Transfer buffer */
    size_t rxDataSize;         /*!< Transfer size */
    status_t completionStatus; /*!< Success or error code describing how the transfer completed. Only applies for
                                  #kI3C_SlaveCompletionEvent. */
    size_t transferredCount;   /*!< Number of bytes actually transferred since start or last repeated start. */
} i3c_slave_transfer_t;

/* Forward declaration. */
typedef struct _i3c_slave_handle i3c_slave_handle_t;

/*!
 * @brief Slave event callback function pointer type.
 *
 * This callback is used only for the slave non-blocking transfer API. To install a callback,
 * use the I3C_SlaveSetCallback() function after you have created a handle.
 *
 * @param base Base address for the I3C instance on which the event occurred.
 * @param transfer Pointer to transfer descriptor containing values passed to and/or from the callback.
 * @param userData Arbitrary pointer-sized value passed from the application.
 */
typedef void (*i3c_slave_transfer_callback_t)(I3C_Type *base, i3c_slave_transfer_t *transfer, void *userData);

/*!
 * @brief I3C slave handle structure.
 * @note The contents of this structure are private and subject to change.
 */
struct _i3c_slave_handle
{
    i3c_slave_transfer_t transfer;          /*!< I3C slave transfer copy. */
    bool isBusy;                            /*!< Whether transfer is busy. */
    bool wasTransmit;                       /*!< Whether the last transfer was a transmit. */
    uint32_t eventMask;                     /*!< Mask of enabled events. */
    uint32_t transferredCount;              /*!< Count of bytes transferred. */
    i3c_slave_transfer_callback_t callback; /*!< Callback function called at transfer event. */
    void *userData;                         /*!< Callback parameter passed to callback. */
    uint8_t txFifoSize;                     /*!< Tx Fifo size */
};

/*! @brief Typedef for slave interrupt handler. */
typedef void (*i3c_slave_isr_t)(I3C_Type *base, void *handle);
/*! @} */

/*!
 * @addtogroup i3c_common_driver
 * @{
 */

/*!
 * @brief Structure with settings to initialize the I3C module, could both initialize master and slave functionality.
 *
 * This structure holds configuration settings for the I3C peripheral. To initialize this
 * structure to reasonable defaults, call the I3C_GetDefaultConfig() function and
 * pass a pointer to your configuration structure instance.
 *
 * The configuration structure can be made constant so it resides in flash.
 */
typedef struct _i3c_config
{
    i3c_master_enable_t enableMaster; /*!< Enable master mode. */
    bool disableTimeout;              /*!< Whether to disable timeout to prevent the ERRWARN. */
    i3c_master_hkeep_t hKeep;         /*!< High keeper mode setting. */
    bool enableOpenDrainStop;         /*!< Whether to emit open-drain speed STOP. */
    bool enableOpenDrainHigh;         /*!< Enable Open-Drain High to be 1 PPBAUD count for i3c messages, or 1 ODBAUD. */
    i3c_baudrate_hz_t baudRate_Hz;    /*!< Desired baud rate settings. */
#if defined(FSL_FEATURE_I3C_HAS_START_SCL_DELAY) && FSL_FEATURE_I3C_HAS_START_SCL_DELAY
    i3c_start_scl_delay_t startSclDelay;   /*!< I3C SCL delay after START. */
    i3c_start_scl_delay_t restartSclDelay; /*!< I3C SCL delay after Repeated START. */
#endif
    uint8_t masterDynamicAddress;          /*!< Main master dynamic address configuration. */
#if !(defined(FSL_FEATURE_I3C_HAS_NO_SCONFIG_BAMATCH) && FSL_FEATURE_I3C_HAS_NO_SCONFIG_BAMATCH)
    uint32_t slowClock_Hz;                 /*!< Slow clock frequency for time control. */
#endif
    uint32_t maxWriteLength;               /*!< Maximum write length. */
    uint32_t maxReadLength;                /*!< Maximum read length. */
    bool enableSlave;                      /*!< Whether to enable slave. */
#if !(defined(FSL_FEATURE_I3C_HAS_NO_SLAVE_IBI_MR_HJ) && FSL_FEATURE_I3C_HAS_NO_SLAVE_IBI_MR_HJ)
    bool isHotJoin;                        /*!< Whether to enable slave hotjoin before enable slave. */
#endif
    uint8_t staticAddr;                    /*!< Static address. */
    uint16_t vendorID;                     /*!< Device vendor ID(manufacture ID). */
#if !(defined(FSL_FEATURE_I3C_HAS_NO_SCONFIG_IDRAND) && FSL_FEATURE_I3C_HAS_NO_SCONFIG_IDRAND)
    bool enableRandomPart;                 /*!< Whether to generate random part number, if using random part number,
                                                the partNumber variable setting is meaningless. */
#endif
    uint32_t partNumber;                   /*!< Device part number info */
    uint8_t dcr;                           /*!< Device characteristics register information. */
    uint8_t bcr;                           /*!< Bus characteristics register information. */
    uint8_t hdrMode;                       /*!< Support hdr mode, could be OR logic in enumeration:i3c_hdr_mode_t. */
    bool nakAllRequest;                    /*!< Whether to reply NAK to all requests except broadcast CCC. */
    bool ignoreS0S1Error;                  /*!< Whether to ignore S0/S1 error in SDR mode. */
    bool offline; /*!< Whether to wait 60 us of bus quiet or HDR request to ensure slave track SDR mode safely. */
    bool matchSlaveStartStop; /*!< Whether to assert start/stop status only the time slave is addressed. */
} i3c_config_t;

/*! @} */

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! Array to map I3C instance number to IRQ number. */
extern IRQn_Type const kI3cIrqs[];

