vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/drivers/fsl_i3c.h
/* Not static so it can be used from fsl_i3c_dma.c. */
status_t I3C_SlaveCheckAndClearError(I3C_Type *base, uint32_t status);
/*! @} */

/*! @name Interrupts */
/*! @{ */

/*!
 * @brief Enables the I3C slave interrupt requests.
 *
 * Only below flags can be enabled as interrupts.
 * - #kI3C_SlaveBusStartFlag
 * - #kI3C_SlaveMatchedFlag
 * - #kI3C_SlaveBusStopFlag
 * - #kI3C_SlaveRxReadyFlag
 * - #kI3C_SlaveTxReadyFlag
 * - #kI3C_SlaveDynamicAddrChangedFlag
 * - #kI3C_SlaveReceivedCCCFlag
 * - #kI3C_SlaveErrorFlag
 * - #kI3C_SlaveHDRCommandMatchFlag
 * - #kI3C_SlaveCCCHandledFlag
 * - #kI3C_SlaveEventSentFlag
 *
 * @param base The I3C peripheral base address.
 * @param interruptMask Bit mask of interrupts to enable. See #_i3c_slave_flags for the set
 *      of constants that should be OR'd together to form the bit mask.
 */
static inline void I3C_SlaveEnableInterrupts(I3C_Type *base, uint32_t interruptMask)
{
    base->SINTSET |= interruptMask;
}

/*!
 * @brief Disables the I3C slave interrupt requests.
 *
 * Only below flags can be disabled as interrupts.
 * - #kI3C_SlaveBusStartFlag
 * - #kI3C_SlaveMatchedFlag
 * - #kI3C_SlaveBusStopFlag
 * - #kI3C_SlaveRxReadyFlag
 * - #kI3C_SlaveTxReadyFlag
 * - #kI3C_SlaveDynamicAddrChangedFlag
 * - #kI3C_SlaveReceivedCCCFlag
 * - #kI3C_SlaveErrorFlag
 * - #kI3C_SlaveHDRCommandMatchFlag
 * - #kI3C_SlaveCCCHandledFlag
 * - #kI3C_SlaveEventSentFlag
 *
 * @param base The I3C peripheral base address.
 * @param interruptMask Bit mask of interrupts to disable. See #_i3c_slave_flags for the set
 *      of constants that should be OR'd together to form the bit mask.
 */
static inline void I3C_SlaveDisableInterrupts(I3C_Type *base, uint32_t interruptMask)
{
    base->SINTCLR = interruptMask;
}

/*!
 * @brief Returns the set of currently enabled I3C slave interrupt requests.
 *
 * @param base The I3C peripheral base address.
 * @return A bitmask composed of #_i3c_slave_flags enumerators OR'd together to indicate the
 *      set of enabled interrupts.
 */
static inline uint32_t I3C_SlaveGetEnabledInterrupts(I3C_Type *base)
{
    return base->SINTSET;
}

/*!
 * @brief Returns the set of pending I3C slave interrupt requests.
 *
 * @param base The I3C peripheral base address.
 * @return A bitmask composed of #_i3c_slave_flags enumerators OR'd together to indicate the
 *      set of pending interrupts.
 */
static inline uint32_t I3C_SlaveGetPendingInterrupts(I3C_Type *base)
{
    return base->SINTMASKED;
}

/*! @} */

/*! @name DMA control */
/*! @{ */

/*!
 * @brief Enables or disables I3C slave DMA requests.
 *
 * @param base The I3C peripheral base address.
 * @param enableTx Enable flag for transmit DMA request. Pass true for enable, false for disable.
 * @param enableRx Enable flag for receive DMA request. Pass true for enable, false for disable.
 * @param width DMA read/write unit in bytes.
 */
static inline void I3C_SlaveEnableDMA(I3C_Type *base, bool enableTx, bool enableRx, uint32_t width)
{
    assert(width <= 2U);
    base->SDMACTRL =
        I3C_SDMACTRL_DMAFB(enableRx ? 2U : 0U) | I3C_SDMACTRL_DMATB(enableTx ? 2U : 0U) | I3C_SDMACTRL_DMAWIDTH(width);
}

/*!
 * @brief Gets I3C slave transmit data register address for DMA transfer.
 *
 * @param base The I3C peripheral base address.
 * @param width DMA read/write unit in bytes.
 * @return The I3C Slave Transmit Data Register address.
 */
static inline uint32_t I3C_SlaveGetTxFifoAddress(I3C_Type *base, uint32_t width)
{
    assert(width <= 2U);
    return (uint32_t)((width == 2U) ? &base->SWDATAH : &base->SWDATAB);
}

/*!
 * @brief Gets I3C slave receive data register address for DMA transfer.
 *
 * @param base The I3C peripheral base address.
 * @param width DMA read/write unit in bytes.
 * @return The I3C Slave Receive Data Register address.
 */
static inline uint32_t I3C_SlaveGetRxFifoAddress(I3C_Type *base, uint32_t width)
{
    assert(width <= 2U);
    return (uint32_t)((width == 2U) ? &base->SRDATAH : &base->SRDATAB);
}

/*! @} */

/*! @name FIFO control */
/*! @{ */

/*!
 * @brief Sets the watermarks for I3C slave FIFOs.
 *
 * @param base The I3C peripheral base address.
 * @param txLvl Transmit FIFO watermark level. The #kI3C_SlaveTxReadyFlag flag is set whenever
 *      the number of words in the transmit FIFO reaches @a txLvl.
 * @param rxLvl Receive FIFO watermark level. The #kI3C_SlaveRxReadyFlag flag is set whenever
 *      the number of words in the receive FIFO reaches @a rxLvl.
 * @param flushTx true if TX FIFO is to be cleared, otherwise TX FIFO remains unchanged.
 * @param flushRx true if RX FIFO is to be cleared, otherwise RX FIFO remains unchanged.
 */
static inline void I3C_SlaveSetWatermarks(
    I3C_Type *base, i3c_tx_trigger_level_t txLvl, i3c_rx_trigger_level_t rxLvl, bool flushTx, bool flushRx)
{
    base->SDATACTRL = I3C_SDATACTRL_UNLOCK_MASK | I3C_SDATACTRL_TXTRIG(txLvl) | I3C_SDATACTRL_RXTRIG(rxLvl) |
                      (flushTx ? I3C_SDATACTRL_FLUSHTB_MASK : 0U) | (flushRx ? I3C_SDATACTRL_FLUSHFB_MASK : 0U);
}

/*!
 * @brief Gets the current number of bytes in the I3C slave FIFOs.
 *
 * @param base The I3C peripheral base address.
 * @param[out] txCount Pointer through which the current number of bytes in the transmit FIFO is returned.
 *      Pass NULL if this value is not required.
 * @param[out] rxCount Pointer through which the current number of bytes in the receive FIFO is returned.
 *      Pass NULL if this value is not required.
 */
static inline void I3C_SlaveGetFifoCounts(I3C_Type *base, size_t *rxCount, size_t *txCount)
{
    if (NULL != txCount)
    {
        *txCount = (base->SDATACTRL & I3C_SDATACTRL_TXCOUNT_MASK) >> I3C_SDATACTRL_TXCOUNT_SHIFT;
    }
    if (NULL != rxCount)
    {
        *rxCount = (base->SDATACTRL & I3C_SDATACTRL_RXCOUNT_MASK) >> I3C_SDATACTRL_RXCOUNT_SHIFT;
    }
}

/*! @} */

